# CanToggleBetweenPerspectiveAndIsometric Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
View3D..::..CanToggleBetweenPerspectiveAndIsometric Method
View3D Class See Also
---
Checks whether this view can toggle between perspective and isometric.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015 Subscription Update
# Syntax
C#
---
```text
public bool CanToggleBetweenPerspectiveAndIsometric()
```

Visual Basic
---
```text
Public Function CanToggleBetweenPerspectiveAndIsometric As Boolean
```

Visual C++
---
```text
public:
bool CanToggleBetweenPerspectiveAndIsometric()
```

# ### Return Value
True if this view can be toggled, false otherwise.
# Remarks
This view can only be toggled if no view specific elements are contained.
# See Also
View3D Class
Autodesk.Revit.DB Namespace